tap "homebrew/bundle"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"

# Core / Unix
brew "universal-ctags", args: ["HEAD"]
brew "git"
brew "openssl"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "zsh"


# Other pre-reqs
brew "libyaml" # should come after openssl
brew "coreutils"
brew "yarn"
cask "gpg-suite"

brew "brew-cask-completion"
brew "fish"
brew "hub"
brew "mas"
brew "overmind"

cask "1password"
cask "dropbox"
cask "google-chrome"
cask "istat-menus"
cask "iterm2"
cask "java"
cask "lastpass"

cask "notion"
cask "hammerspoon"

cask "karabiner-elements"
cask "keepassx"
cask "slack"
cask "the-unarchiver"
cask "visual-studio-code"

cask "sourcetree"

#cask "adobe-acrobat-reader"
#cask "adobe-air"
#cask "alfred"
#cask "android-sdk"
#cask "android-studio"
#cask "bartender"
#cask "brave-browser"
#cask "cleanmymac"
#cask "daisydisk"
#cask "dashlane"
#cask "discord"
#cask "docker"
#cask "dropbox"
#cask "firefox"
#cask "flux"
#cask "ganache"
#cask "godot"
#cask "google-backup-and-sync"
#cask "google-chrome"
#cask "hammerspoon"
#cask "intellij-idea"
#cask "iterm2"
#cask "java8"
#cask "karabiner-elements"
#cask "keepassx"
#cask "little-snitch"
#cask "love"
#cask "mac2imgur"
#cask "microsoft-office"
#cask "microsoft-teams"
#cask "mongodb-compass"
#cask "mysqlworkbench"
#cask "nordvpn"
#cask "paintbrush"
#cask "pgadmin4"
#cask "postman"
#cask "real-vnc"
#cask "skype"
#cask "slack"
#cask "soulseek"
#cask "soundflower"
#cask "spotify"
#cask "starleaf"
#cask "steam"
#cask "teamviewer"
#cask "telegram"
#cask "the-unarchiver"
#cask "transmission"
#cask "unity"
#cask "viscosity"
#cask "visual-studio-code"
#cask "vlc"
#cask "vmware-fusion"
#cask "webstorm"
#cask "whatsapp"
#cask "xerox-print-driver"
#cask "xquartz"

#mas "Amphetamine", id: 937984704
#mas "Microsoft Remote Desktop 10", id: 1295203466
#mas "Shotty", id: 1250306151
#mas "Xcode", id: 497799835
